<?php
/*بیس روتی که در htaccess نوشته بودیم  فقط برای فایل های داخل کنترلر قابل استفاده است و برای فایل های html , css  ما باید در هنگام آدرس دادن حتما framework را در ابتدای مسیرمان بنویسیم*/
/*نحوه نوشتن url از این به بعد به این صورت است : /framework/controller/method/parametr*/
/*ما در این صفحه تیکه های مختلف url مان را که شمال controller ,method ,parametr می باشد را جدا می کنیم*/
define('test', true);

require_once(getcwd() . '/system/loader.php');/*تابع get_cwd() ادرس جایی که هستیم را نشان می دهد و ما باید این تابع را بنویسیم تا بتوانیم به محتوای دایرکتوری زردزنگ دسترسی پیدا کنیم*/

$uri = getRequestUri();/*با این تابع ما ادرس uri مان را میگیریم البته بعد از دات کام یا دات آی آر اش را */
$uri = str_replace(baseUrl() . '/', '/', $uri);/*ما با این دستور عبارت/notes-v2 را با یک / جایگزین می کنیم و میریزیم داخل متغیرuri*/

global $config;/*این دستور را می نوسیم برای اینکه به متغیر کانفیگ با ایندکس روت که در داخل config.php نوشته شده بود دست پیدا کنیم*/
$route = $config['route'];

$uri = urldecode($uri);/*در ابتدا uri به صورت encode شده می باشد که قابل فهم برای ماشین است و ما باید آن را با این دستور decode کنیم تا برایمان قابل فهم شود*/
foreach ($route as $alias=>$target){/*در اینجا منظور از alias ،عبارت login/ و منظور از target ، عبارت user/login/ در متغیر کانفیک با ایندکس روت می باشد و دستورات زیر را برای آنها اجرا میکند */
  $alias = '^' . $alias;/*با این دستور داریم میگیم که alias می بایست در ابتدای متغیر uri ما نوشته شود*/
  $alias = str_replace('/', '\/', $alias);/*چون در ریجکس علامت/ برای خودش یک معنایی دارد لذا ما باید قبل از آن \ قرار دهیم و در واقع علامت / در config.php ودر ابتدای مثلا login با /\ جایگزین می شود*/
  $alias = str_replace('*', '(.*)', $alias);/*این دستور علامت * در فایل config.php و در پایین صفحه را به کپچرینگ گروه*. تبدیل می کند که کاربرد آن این است که هرچیزی که بعد از profile بنویسیم را بعد از / می نویسد*/

  if (preg_match('/'.$alias.'/', $uri)) {/*می آید و بررسی می کند که آیا عبارت alias در داخل متغیر uri وجود دارد و اگر دارد دستورزیر را اجرا کن*/
    $uri = preg_replace('/'.$alias.'/', $target, $uri);/*عبارت موجود در alias را را عبارت داخل target جایگزین(replace) می کند و می ریزد داخل متغیر uri*/
  }/*فرارداد: هروقت جایی خواستیم از کد regex استفاده کنیم ، حتما باید اول و آخرش / بگذاریم*/
}

$parts = explode('/', $uri);/*آدرس uri گرفته شده مان را براساس / می شکنیم و جدا می کنیم*/
$controller = $parts[1];/*قسمت اول جدا شده را اسمش را می گذاریم کنترلر*/
$method = $parts[2];/*قسمت دوم جدا شده را اسمش را می گذاریم متود*/

$params = array();
for ($i=3; $i<count($parts); $i++){/*این حلقه برای نمایش تعداد پارامتر های بعد از متود به کار می رود و آنها را نمایش می دهد*/
  $params[] = $parts[$i];
}

$controllerClassname = ucfirst($controller) . "Controller";/*اسم کلاس نیم ما به این صورت است که حرف اول متغیر کنترلر را بزرگ می کند و بعد کلمه کنترلر را به آن می چسباند*/
$controllerInstance = new $controllerClassname();/*یک نمونه از کنترلر می سازد*/
call_user_func_array(array($controllerInstance, $method), $params);/*ما را به داخل دایرکتوری کنترلر مربوطه هدایت می کند و تمام متودها و پارامترهای آنها را می خواند و صدا می زند*/
