<?php
class PageController {/*کار این کنترلر گرفتن لیست یادداشت های کاربران می باشد*/
  public function home() {
    $isGuest = !isset($_SESSION['email']);/*اگر کاربر ایمیلش ست نشده باشد پس کاربر ما مهمان است*/

    if (!$isGuest) {/*اگر کاربر ما مهمان نبود دستورات زیر را اجرا می کند*/
      $user_id = $_SESSION['user_id'];
      $data['records'] = NoteModel::catalog($user_id);/*براساس یوزرآیدی کاربر با استفاده تابع کاتالوگ لیست یادداشت های کاربر را می گیرد و داخل ایندکس records اِ متغیر دیتا می ریزد*/
    } else {/*قرارداد: ما کلن هرچیزی که قرار باشد یه لیستی را به ما برگرداند و تحویل دهد اسمش را catalog می گذاریم*/
      $data['records'] = null;
    }

    $data['isGuest'] = $isGuest;/*اینو نوشتیم چونةدر فولدر ویو و در home.php متغیر isGuest نوشته شده است در حالی که تعریف نشده بود و با این کار ما این متغیر را تعریف می کنیم*/
    View::render("/page/home.php", $data);/*این کد ما را به دایرکتوری مربوط به html صفحه home هدایت می کند*/
  }
}